!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
!!!!!!!!!!!!!!!!!!!!!!!! 计算地图放大系数m、地转参数f !!!!!!!!!!!!!!!!!!!!!!!!!
!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    
MODULE module_m_f
    contains
    SUBROUTINE m_f(m, f, d, clat, nx, ny)
    ! 地球半径a /米
    ! 兰伯特投影标准余纬sita/ 度
    ! 兰伯特地图投影面上赤道到北极点的距离le /米
    ! 地球放大系数(兰伯特投影)k
    ! 区域中心纬度clat/度
    ! 兰伯特地图投影面上区域中心到北极点的距离rl 米
    ! 某网格点距北极点的距离l
    ! 网格距d
    ! 地球旋转角速度omiga
    ! 圆周率pi
        IMPLICIT NONE
    
        INTEGER :: nx, ny  ! 定义区域格点数
        INTEGER :: i, j
        REAL, PARAMETER :: a = 6371000.0, sita = 30.0, k = 0.7156 , pi = 3.1415926 !!!!!! 定义常数值
        REAL :: d  !  定义网格距
        REAL :: clat  !  定义区域中心纬度
        REAL :: rl  !  定义区域中心到北极点的距离
        REAL :: le  !   定义赤道到北极点的距离 
        REAL :: x0, y0  !  定义坐标原点相对于区域中心上方的北极点的位置(格点) 
        REAL :: xi, yj  !  定义网格点相对于区域中心上方的北极点的位置(格点) 
        REAL :: l  !  某网格点距北极点的距离
        REAL :: omiga  !  地球旋转角速度
        REAL :: temp1, temp2
        REAL :: m(nx, ny), f(nx, ny)  !  定义地图放大系数m和地转参数f的数组
    
        !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 计算le与rl过程中的中间量!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
        temp1 = a * sind(sita) / k

        !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 计算赤道到北极点的距离!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
        le = temp1 * (1 / tand(sita / 2.0) ** k)
    
        !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 计算区域中心到北极点的距离!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
        rl = temp1 * (tand((90 - clat) / 2.0) / tand(sita / 2.0)) ** k
    
        !!!!!!!!!!!! 确定坐标原点o(左下角)在地图投影坐标系中的位置(相对于区域中心上方的北极点)!!!!!!!!!!!!!
        x0 = -1 * (nx - 1) / 2.0
        y0 = -1 * (rl / d + (ny - 1) / 2.0)
    
        !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 计算各网格点对应的地图放大系数m和地转参数f!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
        do i = 1, nx
            do j = 1, ny
                !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 计算m和f过程中的过度量!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                xi = x0 + (i - 1)
                yj = y0 + (j - 1)  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 原点o
                l = sqrt(xi **2 + yj ** 2) * d  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 某网格点距北极点的距离
                temp2 = (l / le) ** (2.0 / k)
                temp2 = (1 - temp2) / (1 + temp2)
            
                !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 计算地图放大系数m!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                m(i, j) = k * l / (a * sqrt(1 - temp2 ** 2))
                !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 计算地转参数f !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                omiga = 2 * pi / (3600 * 24)
                f(i, j) = 2 * omiga * temp2
            enddo
        enddo
        return
    END SUBROUTINE m_f
END MODULE